ataradov/mcu-starter-projects/samg53/include/pio/samg53n19.h
/* ========== PIO definition for ADC peripheral ========== */
#define PIN_PA8B_ADC_ADTRG                         _L_(8)       /**< ADC signal: ADTRG on PA8 mux B*/
#define MUX_PA8B_ADC_ADTRG                         _L_(1)       /**< ADC signal line function value: ADTRG */
#define PIO_PA8B_ADC_ADTRG                         (_UL_(1) << 8)

#define PIN_PA17X1_ADC_AD0                         _L_(17)      /**< ADC signal: AD0 on PA17 mux X1*/
#define PIO_PA17X1_ADC_AD0                         (_UL_(1) << 17)

#define PIN_PA18X1_ADC_AD1                         _L_(18)      /**< ADC signal: AD1 on PA18 mux X1*/
#define PIO_PA18X1_ADC_AD1                         (_UL_(1) << 18)

#define PIN_PA19X1_ADC_AD2                         _L_(19)      /**< ADC signal: AD2 on PA19 mux X1*/
#define PIO_PA19X1_ADC_AD2                         (_UL_(1) << 19)

#define PIN_PA20X1_ADC_AD3                         _L_(20)      /**< ADC signal: AD3 on PA20 mux X1*/
#define PIO_PA20X1_ADC_AD3                         (_UL_(1) << 20)

#define PIN_PB0X1_ADC_AD4                          _L_(32)      /**< ADC signal: AD4 on PB0 mux X1*/
#define PIO_PB0X1_ADC_AD4                          (_UL_(1) << 0)

#define PIN_PB1X1_ADC_AD5                          _L_(33)      /**< ADC signal: AD5 on PB1 mux X1*/
#define PIO_PB1X1_ADC_AD5                          (_UL_(1) << 1)

#define PIN_PB2X1_ADC_AD6                          _L_(34)      /**< ADC signal: AD6 on PB2 mux X1*/
#define PIO_PB2X1_ADC_AD6                          (_UL_(1) << 2)

#define PIN_PB2X1_ADC_WKUP12                       _L_(34)      /**< ADC signal: WKUP12 on PB2 mux X1*/
#define PIO_PB2X1_ADC_WKUP12                       (_UL_(1) << 2)

#define PIN_PB3X1_ADC_AD7                          _L_(35)      /**< ADC signal: AD7 on PB3 mux X1*/
#define PIO_PB3X1_ADC_AD7                          (_UL_(1) << 3)

#define PIN_PB3X1_ADC_WKUP13                       _L_(35)      /**< ADC signal: WKUP13 on PB3 mux X1*/
#define PIO_PB3X1_ADC_WKUP13                       (_UL_(1) << 3)

/* ========== PIO definition for I2SC0 peripheral ========== */
#define PIN_PA0A_I2SC0_I2SC0_CK                    _L_(0)       /**< I2SC0 signal: I2SC0_CK on PA0 mux A*/
#define MUX_PA0A_I2SC0_I2SC0_CK                    _L_(0)       /**< I2SC0 signal line function value: I2SC0_CK */
#define PIO_PA0A_I2SC0_I2SC0_CK                    (_UL_(1) << 0)

#define PIN_PA2B_I2SC0_I2SC0_DI0                   _L_(2)       /**< I2SC0 signal: I2SC0_DI0 on PA2 mux B*/
#define MUX_PA2B_I2SC0_I2SC0_DI0                   _L_(1)       /**< I2SC0 signal line function value: I2SC0_DI0 */
#define PIO_PA2B_I2SC0_I2SC0_DI0                   (_UL_(1) << 2)

#define PIN_PA3B_I2SC0_I2SC0_DO0                   _L_(3)       /**< I2SC0 signal: I2SC0_DO0 on PA3 mux B*/
#define MUX_PA3B_I2SC0_I2SC0_DO0                   _L_(1)       /**< I2SC0 signal line function value: I2SC0_DO0 */
#define PIO_PA3B_I2SC0_I2SC0_DO0                   (_UL_(1) << 3)

#define PIN_PA17A_I2SC0_I2SC0_DO0                  _L_(17)      /**< I2SC0 signal: I2SC0_DO0 on PA17 mux A*/
#define MUX_PA17A_I2SC0_I2SC0_DO0                  _L_(0)       /**< I2SC0 signal line function value: I2SC0_DO0 */
#define PIO_PA17A_I2SC0_I2SC0_DO0                  (_UL_(1) << 17)

#define PIN_PA4B_I2SC0_I2SC0_MCK                   _L_(4)       /**< I2SC0 signal: I2SC0_MCK on PA4 mux B*/
#define MUX_PA4B_I2SC0_I2SC0_MCK                   _L_(1)       /**< I2SC0 signal line function value: I2SC0_MCK */
#define PIO_PA4B_I2SC0_I2SC0_MCK                   (_UL_(1) << 4)

#define PIN_PA18A_I2SC0_I2SC0_MCK                  _L_(18)      /**< I2SC0 signal: I2SC0_MCK on PA18 mux A*/
#define MUX_PA18A_I2SC0_I2SC0_MCK                  _L_(0)       /**< I2SC0 signal line function value: I2SC0_MCK */
#define PIO_PA18A_I2SC0_I2SC0_MCK                  (_UL_(1) << 18)

#define PIN_PA1A_I2SC0_I2SC0_WS                    _L_(1)       /**< I2SC0 signal: I2SC0_WS on PA1 mux A*/
#define MUX_PA1A_I2SC0_I2SC0_WS                    _L_(0)       /**< I2SC0 signal line function value: I2SC0_WS */
#define PIO_PA1A_I2SC0_I2SC0_WS                    (_UL_(1) << 1)

/* ========== PIO definition for I2SC1 peripheral ========== */
#define PIN_PA19B_I2SC1_I2SC1_CK                   _L_(19)      /**< I2SC1 signal: I2SC1_CK on PA19 mux B*/
#define MUX_PA19B_I2SC1_I2SC1_CK                   _L_(1)       /**< I2SC1 signal line function value: I2SC1_CK */
#define PIO_PA19B_I2SC1_I2SC1_CK                   (_UL_(1) << 19)

#define PIN_PA22B_I2SC1_I2SC1_DI0                  _L_(22)      /**< I2SC1 signal: I2SC1_DI0 on PA22 mux B*/
#define MUX_PA22B_I2SC1_I2SC1_DI0                  _L_(1)       /**< I2SC1 signal line function value: I2SC1_DI0 */
#define PIO_PA22B_I2SC1_I2SC1_DI0                  (_UL_(1) << 22)

#define PIN_PA23A_I2SC1_I2SC1_DO0                  _L_(23)      /**< I2SC1 signal: I2SC1_DO0 on PA23 mux A*/
#define MUX_PA23A_I2SC1_I2SC1_DO0                  _L_(0)       /**< I2SC1 signal line function value: I2SC1_DO0 */
#define PIO_PA23A_I2SC1_I2SC1_DO0                  (_UL_(1) << 23)

#define PIN_PA24A_I2SC1_I2SC1_MCK                  _L_(24)      /**< I2SC1 signal: I2SC1_MCK on PA24 mux A*/
#define MUX_PA24A_I2SC1_I2SC1_MCK                  _L_(0)       /**< I2SC1 signal line function value: I2SC1_MCK */
#define PIO_PA24A_I2SC1_I2SC1_MCK                  (_UL_(1) << 24)

#define PIN_PA20B_I2SC1_I2SC1_WS                   _L_(20)      /**< I2SC1 signal: I2SC1_WS on PA20 mux B*/
#define MUX_PA20B_I2SC1_I2SC1_WS                   _L_(1)       /**< I2SC1 signal line function value: I2SC1_WS */
#define PIO_PA20B_I2SC1_I2SC1_WS                   (_UL_(1) << 20)

/* ========== PIO definition for PDMIC0 peripheral ========== */
#define PIN_PA10B_PDMIC0_PDMIC0_CLK                _L_(10)      /**< PDMIC0 signal: PDMIC0_CLK on PA10 mux B*/
#define MUX_PA10B_PDMIC0_PDMIC0_CLK                _L_(1)       /**< PDMIC0 signal line function value: PDMIC0_CLK */
#define PIO_PA10B_PDMIC0_PDMIC0_CLK                (_UL_(1) << 10)

#define PIN_PA9B_PDMIC0_PDMIC0_DAT                 _L_(9)       /**< PDMIC0 signal: PDMIC0_DAT on PA9 mux B*/
#define MUX_PA9B_PDMIC0_PDMIC0_DAT                 _L_(1)       /**< PDMIC0 signal line function value: PDMIC0_DAT */
#define PIO_PA9B_PDMIC0_PDMIC0_DAT                 (_UL_(1) << 9)

/* ========== PIO definition for PMC peripheral ========== */
#define PIN_PA6B_PMC_PCK0                          _L_(6)       /**< PMC signal: PCK0 on PA6 mux B*/
#define MUX_PA6B_PMC_PCK0                          _L_(1)       /**< PMC signal line function value: PCK0 */
#define PIO_PA6B_PMC_PCK0                          (_UL_(1) << 6)

