ataradov/mcu-starter-projects/samg53/include/pio/samg53n19.h
/* ========== PIO definition for TWI2 peripheral ========== */
#define PIN_PB1B_TWI2_TWCK2                        _L_(33)      /**< TWI2 signal: TWCK2 on PB1 mux B*/
#define MUX_PB1B_TWI2_TWCK2                        _L_(1)       /**< TWI2 signal line function value: TWCK2 */
#define PIO_PB1B_TWI2_TWCK2                        (_UL_(1) << 1)

#define PIN_PB11B_TWI2_TWCK2                       _L_(43)      /**< TWI2 signal: TWCK2 on PB11 mux B*/
#define MUX_PB11B_TWI2_TWCK2                       _L_(1)       /**< TWI2 signal line function value: TWCK2 */
#define PIO_PB11B_TWI2_TWCK2                       (_UL_(1) << 11)

#define PIN_PB0B_TWI2_TWD2                         _L_(32)      /**< TWI2 signal: TWD2 on PB0 mux B*/
#define MUX_PB0B_TWI2_TWD2                         _L_(1)       /**< TWI2 signal line function value: TWD2 */
#define PIO_PB0B_TWI2_TWD2                         (_UL_(1) << 0)

#define PIN_PB10B_TWI2_TWD2                        _L_(42)      /**< TWI2 signal: TWD2 on PB10 mux B*/
#define MUX_PB10B_TWI2_TWD2                        _L_(1)       /**< TWI2 signal line function value: TWD2 */
#define PIO_PB10B_TWI2_TWD2                        (_UL_(1) << 10)

/* ========== PIO definition for TWI0 peripheral ========== */
#define PIN_PA4A_TWI0_TWCK0                        _L_(4)       /**< TWI0 signal: TWCK0 on PA4 mux A*/
#define MUX_PA4A_TWI0_TWCK0                        _L_(0)       /**< TWI0 signal line function value: TWCK0 */
#define PIO_PA4A_TWI0_TWCK0                        (_UL_(1) << 4)

#define PIN_PA3A_TWI0_TWD0                         _L_(3)       /**< TWI0 signal: TWD0 on PA3 mux A*/
#define MUX_PA3A_TWI0_TWD0                         _L_(0)       /**< TWI0 signal line function value: TWD0 */
#define PIO_PA3A_TWI0_TWD0                         (_UL_(1) << 3)

/* ========== PIO definition for UART0 peripheral ========== */
#define PIN_PA9A_UART0_URXD0                       _L_(9)       /**< UART0 signal: URXD0 on PA9 mux A*/
#define MUX_PA9A_UART0_URXD0                       _L_(0)       /**< UART0 signal line function value: URXD0 */
#define PIO_PA9A_UART0_URXD0                       (_UL_(1) << 9)

#define PIN_PA10A_UART0_UTXD0                      _L_(10)      /**< UART0 signal: UTXD0 on PA10 mux A*/
#define MUX_PA10A_UART0_UTXD0                      _L_(0)       /**< UART0 signal line function value: UTXD0 */
#define PIO_PA10A_UART0_UTXD0                      (_UL_(1) << 10)

/* ========== PIO definition for UART1 peripheral ========== */
#define PIN_PB2A_UART1_URXD1                       _L_(34)      /**< UART1 signal: URXD1 on PB2 mux A*/
#define MUX_PB2A_UART1_URXD1                       _L_(0)       /**< UART1 signal line function value: URXD1 */
#define PIO_PB2A_UART1_URXD1                       (_UL_(1) << 2)

#define PIN_PB3A_UART1_UTXD1                       _L_(35)      /**< UART1 signal: UTXD1 on PB3 mux A*/
#define MUX_PB3A_UART1_UTXD1                       _L_(0)       /**< UART1 signal line function value: UTXD1 */
#define PIO_PB3A_UART1_UTXD1                       (_UL_(1) << 3)

/* ========== PIO definition for USART peripheral ========== */
#define PIN_PA16A_USART_CTS                        _L_(16)      /**< USART signal: CTS on PA16 mux A*/
#define MUX_PA16A_USART_CTS                        _L_(0)       /**< USART signal line function value: CTS */
#define PIO_PA16A_USART_CTS                        (_UL_(1) << 16)

#define PIN_PA15A_USART_RTS                        _L_(15)      /**< USART signal: RTS on PA15 mux A*/
#define MUX_PA15A_USART_RTS                        _L_(0)       /**< USART signal line function value: RTS */
#define PIO_PA15A_USART_RTS                        (_UL_(1) << 15)

#define PIN_PA5A_USART_RXD                         _L_(5)       /**< USART signal: RXD on PA5 mux A*/
#define MUX_PA5A_USART_RXD                         _L_(0)       /**< USART signal line function value: RXD */
#define PIO_PA5A_USART_RXD                         (_UL_(1) << 5)

#define PIN_PA15B_USART_SCK                        _L_(15)      /**< USART signal: SCK on PA15 mux B*/
#define MUX_PA15B_USART_SCK                        _L_(1)       /**< USART signal line function value: SCK */
#define PIO_PA15B_USART_SCK                        (_UL_(1) << 15)

#define PIN_PA6A_USART_TXD                         _L_(6)       /**< USART signal: TXD on PA6 mux A*/
#define MUX_PA6A_USART_TXD                         _L_(0)       /**< USART signal line function value: TXD */
#define PIO_PA6A_USART_TXD                         (_UL_(1) << 6)


#endif /* _SAMG53N19_PIO_H_ */
